soap-ws-client/src/test/resources/getCompanyRequest.soap

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
<ns2:getCompanyRequest xmlns:ns2="http://kp.com/ws"/>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>